DataProcessors/ПривязкаДолгов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПривязкаДолгов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаИтого</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УжеПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязаноИзвне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДокументаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДолга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОстатка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПересчетДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕщеДолг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НельзяПривязывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокПримечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДолга</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвойсПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПривязкаДолгов/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если НЕ Параметры.Свойство("Док") Тогда Отказ = Истина; Возврат; КонецЕсли; 
	Если НЕ Параметры.Свойство("Привязки") Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	РазрешитьПервуюКолонкуПривязкиДолгов = Ложь;	//Константы.РазрешитьПервуюКолонкуПривязкиДолгов.Получить();
	стрПривязкаСправа = НСтр("ru = 'Вносить суммы привязки можно только в колонке <Сумма долга>!'; en = 'You can enter binding sums only in the <Debt sum> column!'");	
	Объект.ДокументОплаты = Параметры.Док;
	Объект.СчетДокументаОплаты = фСчет(Объект.ДокументОплаты);
	
	ХитроеУвеличениеДолга = Ложь;
	
	ПривязкиБезОграничений = Истина;
	
	локПривязки = Параметры.Привязки;
	
	ТолькоПривязки = 0;
	Если Параметры.Свойство("ТолькоПривязки") Тогда ТолькоПривязки = Параметры.ТолькоПривязки КонецЕсли;
	
	//здесь сразу по документу и заполним всю информацию
	//она будет зависеть от вида документа, приход это или расход и кучи других вещей
	
	МожноСуммаДокумента = 0;
	Модиф = Ложь;
	ПравильныйВыход = Ложь;
	
	Объект.ОбщаяСумма 		= 0;
	Объект.УжеПривязано 	= 0;
	Объект.ПривязаноИзвне 	= 0;
	Объект.СтрокаИтого 		= "";
	Объект.Валюта 			= Справочники.Валюты.ПустаяСсылка();
	
	Тек = Объект.ДокументОплаты;
	Вид = "";
	
	//2015.11.26
	Фирма = Тек.Фирма;
	
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда Вид = "ПА" КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ДвижениеДенег") Тогда 
		Если Тек.ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Поставщики Тогда Вид = "ОП" КонецЕсли; 
		Если Тек.ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Покупатели Тогда Вид = "ОК" КонецЕсли; 
	КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда Вид = "НК" КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда Вид = "ВП" КонецЕсли; 
	//Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратПокупателя") Тогда Вид = "ВК" КонецЕсли; 
	//Если ТипЗнч(Тек) = Тип("ДокументСсылка.АктУслуг") Тогда Вид = "УС" КонецЕсли; 
	//Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПриходУслуг") Тогда Вид = "ПУ" КонецЕсли; 
	
	Если Вид = "" Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	Если (Вид = "НК") ИЛИ (Вид = "УС") Тогда
		ТекКон = Тек.Контрагент;
		Если ТекКон.Пустая() Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		Объект.ОбщаяСумма = Тек.Сумма;
		Объект.ПривязаноИзвне = омСервер.ПривязаноИзвне(Тек);
		Объект.Валюта = Тек.Валюта;
		Если Объект.ОбщаяСумма = 0 Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//мне кажется, отнять нужно сразу отсюда
		Объект.ОбщаяСумма = Объект.ОбщаяСумма - Объект.ПривязаноИзвне;
		
		Заголовок = гоИмя(ТекКон, Ложь);
		Фильтр = Новый Структура("Фирма, Контрагент", Тек.Фирма, ТекКон);
		
		Если Объект.ОбщаяСумма < 0 Тогда
			Заголовок = Заголовок + НСтр("ru = ': отрицательный долг по накладной (закрываем предоплаты или возвраты)'; en = ': negative debt on the invoice (we close prepayments or returns)'");
			
			//не пойму пока, что делать
			Возврат;
			
		Иначе
			Заголовок = Заголовок + НСтр("ru = ': привязка предоплат или долгов поставщикам'; en = ': binding prepayments or debts to suppliers'");
			
			//а вот положительная часть работает неплохо!
		КонецЕсли; 
		
		//это начало следующего месяца, все, что до него - можно привязывать к предоплате, а здесь в ее качестве выступает долг поставщику
		МожноДата1 = НачалоМесяца(ДобавитьМесяц(Объект.ДокументОплаты.Дата, 1));
		
		//это начало этого месяца, предоплаты можно привязать только, которые до его начала, т.е. осташиеся ранее
		МожноДата2 = НачалоМесяца(Объект.ДокументОплаты.Дата);
		
		Табл = РегистрыНакопления.Долги.Остатки(, Фильтр, "Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя, ДолгПоставщику, ПредоплатаПоставщику");
		Табл.Свернуть("Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя, ДолгПоставщику, ПредоплатаПоставщику");
		
		Для Каждого Стр Из Табл Цикл
			//31.07.13
			//добавляем всегда пропускать себя
			Если Стр.Док = Объект.ДокументОплаты Тогда Продолжить КонецЕсли; 
			
			НельзяПривязывать = (Стр.Док.Дата >= МожноДата1);
			
			//самый простой вариант - зачет
			
			Если Стр.ДолгПоставщику > 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = 0;
				//Нов.ВалютаДокумента = Объект.Валюта;
				//Нов.СуммаДолга = 0;    
				Нов = НоваяПривязка(Стр);
				//Нов.ВалютаДолга = Стр.Валюта;
				Нов.ОстатокДолга = Стр.ДолгПоставщику;
				//Нов.ВалютаОстатка = Нов.ВалютаДолга;
				//Нов.Док = Стр.Док;
				//Нов.Примечание = "";
				//Нов.ОбратныйКурс = Ложь;
				Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				Нов.ЭтоПредоплата = Ложь;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				//Нов.ДокДата = Нов.Док.Дата;
				//Нов.Склад = фСклад(Нов.Док);
				//Нов.ДокПримечание = фПримечание(Нов.Док);
				//Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			КонецЕсли; 
			
			//но можно же закрыть и предоплату, сделанную ранее
			
			НельзяПривязывать = (Стр.Док.Дата >= МожноДата2);
			
			Если Стр.ПредоплатаПокупателя > 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = 0;
				//Нов.ВалютаДокумента = Объект.Валюта;
				//Нов.СуммаДолга = 0;
				Нов = НоваяПривязка(Стр);
				//Нов.ВалютаДолга = Стр.Валюта;
				Нов.ОстатокДолга = Стр.ПредоплатаПокупателя;
				//Нов.ВалютаОстатка = Нов.ВалютаДолга;
				//Нов.Док = Стр.Док;
				//Нов.Примечание = "";
				//Нов.ОбратныйКурс = Ложь;
				Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				Нов.ЭтоПредоплата = Истина;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				//Нов.ДокДата = Нов.Док.Дата;
				//Нов.Склад = фСклад(Нов.Док);
				//Нов.ДокПримечание = фПримечание(Нов.Док);
				//Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			КонецЕсли; 
		КонецЦикла;
		
		//дальше, если привязки в документе, их тоже нужно добавить
		
		Для Каждого Стр Из локПривязки Цикл
			Отбор = Новый Структура("Док", Стр.Док2);
			
			Ста = Объект.Привязки.НайтиСтроки(Отбор);
	
			Если Ста.Количество() = 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2; 
				Нов = НоваяПривязка2(Стр);
				Нов.ОстатокДолга = 0 + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				Нов.Док = Стр.Док2;
				Если ТипЗнч(Нов.Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
					Нов.ИнвойсПоставщика = Нов.Док.ВКД_ИнвойсПоставщика;
				КонецЕсли;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				
				Если Нов.ЭтоПредоплата Тогда
					Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата2);
				Иначе
					Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата1);
				КонецЕсли; 
				
				Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				Нов.ДокДата = Нов.Док.Дата;
				Нов.Склад = фСклад(Нов.Док);
				Нов.ДокПримечание = фПримечание(Нов.Док);
				Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = Нов.НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			Иначе
				//Нов = Ста[0];
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;
				Нов = НоваяПривязка2(Стр, Ста[0]);
				Нов.ОстатокДолга = Нов.ОстатокДолга + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				Нов.СчетДолга = фСчет(Нов.Док);
			КонецЕсли;
		КонецЦикла; 
		
		Объект.Привязки.Сортировать("НельзяПривязывать Возр, ДатаОплаты Возр, ДокДата Возр, Док Возр");
		
		Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");	// + Объект.ПривязаноИзвне;
		
	ИначеЕсли (Вид = "ПА") ИЛИ (Вид = "ПУ") Тогда
		ТекКон = Тек.Контрагент;
		Если ТекКон.Пустая() Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		Объект.ОбщаяСумма = Тек.Сумма;
		Объект.ПривязаноИзвне = омСервер.ПривязаноИзвне(Тек);
		Объект.Валюта = Тек.Валюта;
		Если Объект.ОбщаяСумма = 0 Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//мне кажется, отнять нужно сразу отсюда
		Объект.ОбщаяСумма = Объект.ОбщаяСумма - Объект.ПривязаноИзвне;
		
		Заголовок = гоИмя(ТекКон, Ложь);
		Фильтр = Новый Структура("Фирма, Контрагент", Тек.Фирма, ТекКон);
		
		Если Объект.ОбщаяСумма < 0 Тогда
			Заголовок = Заголовок + НСтр("ru = ': отрицательный долг по приходу (закрываем предоплаты или возвраты)'; en = ': negative debt upon receipt (we close prepayments or returns)'");
			
			//не пойму пока, что делать
			Возврат;
		Иначе
			Заголовок = Заголовок + НСтр("ru = ': привязка предоплат или долгов покупателей'; en = ': binding prepayments or buyer debts'");
			
			//а вот положительная часть работает неплохо!
		КонецЕсли; 
		
		//это начало следующего месяца, все, что до него - можно привязывать к предоплате, а здесь в ее качестве выступает долг покупателя
		МожноДата1 = НачалоМесяца(ДобавитьМесяц(Объект.ДокументОплаты.Дата, 1));
		
		//это начало этого месяца, предоплаты можно привязать только, которые до его начала, т.е. осташиеся ранее
		МожноДата2 = НачалоМесяца(Объект.ДокументОплаты.Дата);
		
		Табл = РегистрыНакопления.Долги.Остатки(, Фильтр, "Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя, ДолгПоставщику, ПредоплатаПоставщику");
		Табл.Свернуть("Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя, ДолгПоставщику, ПредоплатаПоставщику");
		
		Для Каждого Стр Из Табл Цикл
			//31.07.13
			//добавляем всегда пропускать себя
			Если Стр.Док = Объект.ДокументОплаты Тогда Продолжить КонецЕсли; 
			
			НельзяПривязывать = (Стр.Док.Дата >= МожноДата1);
			
			//самый простой вариант - зачет
			
			Если Стр.ДолгПокупателя > 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = 0;
				//Нов.ВалютаДокумента = Объект.Валюта;
				//Нов.СуммаДолга = 0;
				Нов = НоваяПривязка(Стр);
				//Нов.ВалютаДолга = Стр.Валюта;
				Нов.ОстатокДолга = Стр.ДолгПокупателя;
				//Нов.ВалютаОстатка = Нов.ВалютаДолга;
				//Нов.Док = Стр.Док;
				//Нов.Примечание = "";
				//Нов.ОбратныйКурс = Ложь;
				Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				Нов.ЭтоПредоплата = Ложь;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				//Нов.ДокДата = Нов.Док.Дата;
				//Нов.Склад = фСклад(Нов.Док);
				//Нов.ДокПримечание = фПримечание(Нов.Док);
				//Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			КонецЕсли; 
			
			//но можно же закрыть и предоплату, сделанную ранее
			
			НельзяПривязывать = (Стр.Док.Дата >= МожноДата2);
			
			Если Стр.ПредоплатаПоставщику > 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = 0;
				//Нов.ВалютаДокумента = Объект.Валюта;
				//Нов.СуммаДолга = 0;
				Нов = НоваяПривязка(Стр);
				//Нов.ВалютаДолга = Стр.Валюта;
				Нов.ОстатокДолга = Стр.ПредоплатаПоставщику;
				//Нов.ВалютаОстатка = Нов.ВалютаДолга;
				//Нов.Док = Стр.Док;
				//Нов.Примечание = "";
				//Нов.ОбратныйКурс = Ложь;
				Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				Нов.ЭтоПредоплата = Истина;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				//Нов.ДокДата = Нов.Док.Дата;
				//Нов.Склад = фСклад(Нов.Док);
				//Нов.ДокПримечание = фПримечание(Нов.Док);
				//Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			КонецЕсли; 
		КонецЦикла;
		
		//дальше, если привязки в документе, их тоже нужно добавить
		
		Для Каждого Стр Из локПривязки Цикл
			Отбор = Новый Структура("Док", Стр.Док2);
			
			Ста = Объект.Привязки.НайтиСтроки(Отбор);
	
			Если Ста.Количество() = 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;
				Нов = НоваяПривязка2(Стр);
				Нов.ОстатокДолга = 0 + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				Нов.Док = Стр.Док2;
	Если ТипЗнч(Нов.Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Нов.ИнвойсПоставщика = Нов.Док.ВКД_ИнвойсПоставщика;
	КонецЕсли;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				
				Если Нов.ЭтоПредоплата Тогда
					Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата2);
				Иначе
					Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата1);
				КонецЕсли; 
				
				Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				Нов.ДокДата = Нов.Док.Дата;
				Нов.Склад = фСклад(Нов.Док);
				Нов.ДокПримечание = фПримечание(Нов.Док);
				Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = Нов.НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			Иначе
				//Нов = Ста[0];
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;  
				Нов = НоваяПривязка2(Стр, Ста[0]);
				Нов.ОстатокДолга = Нов.ОстатокДолга + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				Нов.СчетДолга = фСчет(Нов.Док);
			КонецЕсли;
		КонецЦикла; 
		
		Объект.Привязки.Сортировать("НельзяПривязывать Возр, ДатаОплаты Возр, ДокДата Возр, Док Возр");
		
		Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");	// + Объект.ПривязаноИзвне;
		
	ИначеЕсли гоЭто("ОК,ВК", Вид) Тогда
		ТекКон = Тек.Контрагент;
		Если ТекКон.Пустая() Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//это хорошо, но не всегда правильно!!!
		//потому что оплата может быть привязана извне!!!
		//и уже на самом деле привязывать нечего
		//для этого нужно получить обратным счетом те места, где она привязана?
		//а как это сделать?
		//это же пригодится и для всех остальных документов!
		
		Объект.ОбщаяСумма 		= Тек.Сумма;
		Объект.ПривязаноИзвне 	= омСервер.ПривязаноИзвне(Тек);
		Объект.Валюта 			= Тек.Валюта;
		Если Объект.ОбщаяСумма = 0 Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//мне кажется, отнять нужно сразу отсюда
		Объект.ОбщаяСумма = Объект.ОбщаяСумма - Объект.ПривязаноИзвне;
		
		Заголовок = гоИмя(ТекКон, Ложь);
		Фильтр = Новый Структура("Фирма, Контрагент", Тек.Фирма, ТекКон);
		
		Если Вид = "ВК" Тогда
			Если Объект.ОбщаяСумма < 0 Тогда
				Заголовок = Заголовок + НСтр("ru = ': `отрицательный` возврат покупателя (закрываем предоплаты или другие возвраты)'; en = ': `negative` buyer return (we close prepayments or other returns)'");
			Иначе
				Заголовок = Заголовок + НСтр("ru = ': привязка возврата к долгам покупателя (уменьшение долгов)'; en = ': binding the return to the buyer’s debts (debt reduction)'");
			КонецЕсли; 
		Иначе
			Если Объект.ОбщаяСумма < 0 Тогда
				Заголовок = Заголовок + НСтр("ru = ': возврат денег покупателю (закрываем предоплаты или возвраты)'; en = ': refund to the buyer (we close prepayments or returns)'");
				
				//2013.12.17
				//вот здесь можно было бы еще и долг увеличить, по особому алгоритму добавив кучу накладных клиента
				
			Иначе
				Заголовок = Заголовок + НСтр("ru = ': оплата (привязка) долгов покупателя'; en = ': payment (binding) of the buyer’s debts'");
			КонецЕсли; 
		КонецЕсли; 
		
		Табл = РегистрыНакопления.Долги.Остатки(, Фильтр, "Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя");
		Табл.Свернуть("Док, Валюта", "ДолгПокупателя, ПредоплатаПокупателя");
		
		//это начало следующего месяца, все, что до него - можно привязывать к предоплате
		МожноДата = НачалоМесяца(ДобавитьМесяц(Объект.ДокументОплаты.Дата, 1));
		
		Для Каждого Стр Из Табл Цикл
			//31.07.13
			//добавляем всегда пропускать себя
			Если Стр.Док = Объект.ДокументОплаты Тогда Продолжить КонецЕсли; 
			
			//31.07.13
			//возврат и оплата покупателя - это предоплаты, они не могут привязывать документы, которые с начала следующего месяца
			//можно их показать, но выделить цветом, а для этого нужен флаг
			
			НельзяПривязывать = (Стр.Док.Дата >= МожноДата);
			
			Если Объект.ОбщаяСумма < 0 Тогда
				//сначала плюсовые предоплаты, но заносим с минусом
				
				Если Стр.ПредоплатаПокупателя > 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = - Стр.ПредоплатаПокупателя;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Истина;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
				
				//еще можно добавить сюда минусовые долги, если они возникли
				
				Если Стр.ДолгПокупателя < 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = Стр.ДолгПокупателя;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Ложь;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
			Иначе
				Если Стр.ДолгПокупателя > 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга 	= Стр.ДолгПокупателя;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс 		= омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга 	= ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг 		= Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата 	= Ложь;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
				
				//а сюда логично добавить минусовую предоплату с плюсом
				
				Если Стр.ПредоплатаПокупателя < 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = - Стр.ПредоплатаПокупателя;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Истина;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
		//2013.12.17
		//если это ОК и сумма отрицательная
		//в 1с77 была возможность привязать к любой накладной
		//предагается это разрешать не всем
		//и зачем нам куча документов, хватит 10 последних
		//но обязательно закрытых окончательно
		
		//Если (Вид = "ОК") И (Объект.ОбщаяСумма < 0) Тогда
		//	Если гоАдминистратор() ИЛИ гоТуреева() ИЛИ гоКолинко() Тогда
		//		ХитроеУвеличениеДолга = Истина;
		//		
		//		Дней = 999;	//Константа.ЧислоДнейПроверкиВозвратов = 999;
		//		Дат2 = КонецДня(ТекущаяДата());
		//		Дат1 = НачалоДня(глДобавитьДень(Дат2, -Дней));
		//		Если Дат1 < гоНачальнаяДатаЗагруженныхНакладных() Тогда Дат1 = гоНачальнаяДатаЗагруженныхНакладных() КонецЕсли; 
		//		
		//		Сче = 0;
		//		Выборка = Документы.Накладная.Выбрать(Дат1, Дат2, Фильтр, "Дата Убыв"); 
		//		Пока Выборка.Следующий() Цикл
		//			Если Выборка.ПометкаУдаления Тогда Продолжить КонецЕсли; 
		//			Если НЕ Выборка.Проведен Тогда Продолжить КонецЕсли; 
		//			Если Выборка.Окончательно = 0 Тогда Продолжить КонецЕсли; 
		//			
		//			Отбор = Новый Структура("Док", Выборка.Ссылка);
		//			Ста = Объект.Привязки.НайтиСтроки(Отбор);
		//			Если НЕ (Ста.Количество() = 0) Тогда Продолжить КонецЕсли; 
		//			
		//			Нов = Объект.Привязки.Добавить();
		//			
		//			Нов.Док = Выборка.Ссылка;
		//			Нов.СуммаДокумента = 0;
		//			Нов.ВалютаДокумента = Объект.Валюта;
		//			Нов.СуммаДолга = 0;
		//			Нов.ВалютаДолга = Выборка.Валюта;
		//			Нов.ОстатокДолга = омСервер.Долг(Нов.Док, "ДолгПокупателя");
		//			Нов.ВалютаОстатка = Нов.ВалютаДолга;
		//			Нов.Примечание = "";
		//			Нов.ОбратныйКурс = Ложь;
		//			Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
		//			Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
		//			Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
		//			Нов.ЭтоПредоплата = Ложь;
		//			Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
		//			Нов.НельзяПривязывать = НельзяПривязывать;
		//			
		//			Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
		//			Нов.ДокДата = Нов.Док.Дата;
		//			Нов.Склад = фСклад(Нов.Док);
		//			Нов.ДокПримечание = фПримечание(Нов.Док);
		//		
		//		//2015.01.23
		//		Нов.СчетДолга = фСчет(Нов.Док);
		//			
		//			гоПлюс(Сче);
		//			Если Сче > 10 Тогда Прервать КонецЕсли; 
		//		КонецЦикла; 
		//	КонецЕсли; 
		//КонецЕсли; 
		
		//дальше, если привязки в документе, их тоже нужно добавить
		
		Для Каждого Стр Из локПривязки Цикл
			Отбор = Новый Структура("Док", Стр.Док2);
			
			Ста = Объект.Привязки.НайтиСтроки(Отбор);
	
			Если Ста.Количество() = 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;
				Нов = НоваяПривязка2(Стр);
				Нов.ОстатокДолга = 0 + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				Нов.Док = Стр.Док2;
	Если ТипЗнч(Нов.Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Нов.ИнвойсПоставщика = Нов.Док.ВКД_ИнвойсПоставщика;
	КонецЕсли;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				
				Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата);
				
				Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				Нов.ДокДата = Нов.Док.Дата;
				Нов.Склад = фСклад(Нов.Док);
				Нов.ДокПримечание = фПримечание(Нов.Док);
				Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = Нов.НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			Иначе
				//Нов = Ста[0];
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2; 
				Нов = НоваяПривязка2(Стр, Ста[0]);
				Нов.ОстатокДолга = Нов.ОстатокДолга + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				//	Нов.Док = Стр.Док; там уже есть документ
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				
				////Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				////Нов.ДокДата = Нов.Док.Дата;
				////Нов.Склад = фСклад(Нов.Док);
				////Нов.ДокПримечание = фПримечание(Нов.Док);
				
				//2015.01.23
				Нов.СчетДолга = фСчет(Нов.Док);
			КонецЕсли;
		КонецЦикла; 
		
		Объект.Привязки.Сортировать("НельзяПривязывать Возр, ДатаОплаты Возр, ДокДата Возр, Док Возр");
		
		Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");	// + Объект.ПривязаноИзвне;
		
	ИначеЕсли гоЭто("ОП, ВП", Вид) Тогда
		ТекКон = Тек.Контрагент;
		Если ТекКон.Пустая() Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		Объект.ОбщаяСумма = Тек.Сумма;
		Объект.ПривязаноИзвне = омСервер.ПривязаноИзвне(Тек);
		Объект.Валюта = Тек.Валюта;
		Если Объект.ОбщаяСумма = 0 Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//мне кажется, отнять нужно сразу отсюда
		Объект.ОбщаяСумма = Объект.ОбщаяСумма - Объект.ПривязаноИзвне;
		
		Заголовок = гоИмя(ТекКон, Ложь);
		Фильтр = Новый Структура("Фирма, Контрагент", Тек.Фирма, ТекКон);
		
		Если Вид = "ВП" Тогда
			Если Объект.ОбщаяСумма < 0 Тогда
				Заголовок = Заголовок + НСтр("ru = ': `отрицательный` возврат поставщику (закрываем предоплаты или другие возвраты)'; en = ': `negative` return to the supplier (we close prepayments or other returns)'");
			Иначе
				Заголовок = Заголовок + НСтр("ru = ': привязка возврата к долгам поставщику (уменьшение долгов)'; en = ': binding the return to debts to the supplier (debt reduction)'");
			КонецЕсли; 
		Иначе
			Если Объект.ОбщаяСумма < 0 Тогда
				Заголовок = Заголовок + НСтр("ru = ': возврат денег от поставщика (закрываем предоплаты или возвраты)'; en = ': refund from the supplier (we close prepayments or returns)'");
			Иначе
				Заголовок = Заголовок + НСтр("ru = ': оплата (привязка) долгов поставщику'; en = ': payment (binding) of debts to the supplier'");
			КонецЕсли; 
		КонецЕсли; 
		
		Табл = РегистрыНакопления.Долги.Остатки(, Фильтр, "Док, Валюта", "ДолгПоставщику, ПредоплатаПоставщику");
		Табл.Свернуть("Док, Валюта", "ДолгПоставщику, ПредоплатаПоставщику");
		
		//это начало следующего месяца, все, что до него - можно привязывать к предоплате
		МожноДата = НачалоМесяца(ДобавитьМесяц(Объект.ДокументОплаты.Дата, 1));
		
		Для Каждого Стр Из Табл Цикл
			//31.07.13
			//добавляем всегда пропускать себя
			Если Стр.Док = Объект.ДокументОплаты Тогда Продолжить КонецЕсли; 
			
			//31.07.13
			//возврат и оплата покупателя - это предоплаты, они не могут привязывать документы, которые с начала следующего месяца
			//можно их показать, но выделить цветом, а для этого нужен флаг
			
			Попытка
				НельзяПривязывать = (Стр.Док.Дата >= МожноДата);
			Исключение
				НельзяПривязывать = Ложь;
			КонецПопытки; 
			
			Если Объект.ОбщаяСумма < 0 Тогда
				//сначала плюсовые предоплаты, но заносим с минусом
				
				Если Стр.ПредоплатаПоставщику > 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = - Стр.ПредоплатаПоставщику;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Истина;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
				
				//еще можно добавить сюда минусовые долги, если они возникли
				
				Если Стр.ДолгПоставщику < 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = Стр.ДолгПоставщику;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Ложь;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
			Иначе
				Если Стр.ДолгПоставщику > 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = Стр.ДолгПоставщику;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс); 
					// © Primus1C  13.07.2024  НАЧАЛО ►
					Если Нов.ВалютаДокумента.БазоваяВалюта = Нов.ВалютаДолга Тогда
						Нов.ОбратныйКурс = Истина;	
					КонецЕсли;	
					// © Primus1C  ОКОНЧАНИЕ ◄
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Ложь;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
				
				//а сюда логично добавить минусовую предоплату с плюсом
				
				Если Стр.ПредоплатаПоставщику < 0 Тогда
					//Нов = Объект.Привязки.Добавить();
					//
					//Нов.СуммаДокумента = 0;
					//Нов.ВалютаДокумента = Объект.Валюта;
					//Нов.СуммаДолга = 0;
					Нов = НоваяПривязка(Стр);
					//Нов.ВалютаДолга = Стр.Валюта;
					Нов.ОстатокДолга = - Стр.ПредоплатаПоставщику;
					//Нов.ВалютаОстатка = Нов.ВалютаДолга;
					//Нов.Док = Стр.Док;
					//Нов.Примечание = "";
					//Нов.ОбратныйКурс = Ложь;
					Нов.КроссКурс = омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
					Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
					Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
					Нов.ЭтоПредоплата = Истина;
					//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
					
					//Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
					//Нов.ДокДата = Нов.Док.Дата;
					//Нов.Склад = фСклад(Нов.Док);
					//Нов.ДокПримечание = фПримечание(Нов.Док);
					//Нов.СчетДолга = фСчет(Нов.Док);
					////Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
				
		//дальше, если привязки в документе, их тоже нужно добавить
		
		Для Каждого Стр Из локПривязки Цикл
			Отбор = Новый Структура("Док", Стр.Док2);
			
			Ста = Объект.Привязки.НайтиСтроки(Отбор);
	
			Если Ста.Количество() = 0 Тогда
				//Нов = Объект.Привязки.Добавить();
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;     
				Нов = НоваяПривязка2(Стр);
				Нов.ОстатокДолга = 0 + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				Нов.Док = Стр.Док2;
	Если ТипЗнч(Нов.Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Нов.ИнвойсПоставщика = Нов.Док.ВКД_ИнвойсПоставщика;
	КонецЕсли;
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				
				Попытка
					Нов.НельзяПривязывать = (Стр.Док2.Дата >= МожноДата);
				Исключение
					Нов.НельзяПривязывать = Ложь;
				КонецПопытки; 
				
				Нов.ДатаОплаты = фДатаОплаты(Нов.Док);
				Нов.ДокДата = Нов.Док.Дата;
				Нов.Склад = фСклад(Нов.Док);
				Нов.ДокПримечание = фПримечание(Нов.Док);
				Нов.СчетДолга = фСчет(Нов.Док);
				////Нов.НельзяПривязывать = Нов.НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
			Иначе
				//Нов = Ста[0];
				//
				//Нов.СуммаДокумента = Стр.Сумма1;
				//Нов.ВалютаДокумента = Стр.Валюта1;
				//Нов.СуммаДолга = Стр.Сумма2;
				//Нов.ВалютаДолга = Стр.Валюта2;
				Нов = НоваяПривязка2(Стр, Ста[0]);
				Нов.ОстатокДолга = Нов.ОстатокДолга + Стр.Сумма2;
				//Нов.ВалютаОстатка = Стр.Валюта2;
				//	Нов.Док = Стр.Док; там уже есть документ
				//Нов.Примечание = Стр.Примечание;
				//Нов.ОбратныйКурс = Стр.ОбратныйКурс;
				//Нов.КроссКурс = Стр.КроссКурс;
				Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
				Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
				//Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
				//Нов.ЕстьСумма = ?(Нов.СуммаДокумента = 0, 0, 1);
				Нов.СчетДолга = фСчет(Нов.Док);
			КонецЕсли;
		КонецЦикла; 
		
		Объект.Привязки.Сортировать("НельзяПривязывать Возр, ДатаОплаты Возр, ДокДата Возр, Док Возр");
		
		Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");	// + Объект.ПривязаноИзвне;
	КонецЕсли;   
	
	Объект.СтрокаИтого = ?(Объект.ПривязаноИзвне = 0, "", "Привязано извне: " + гоСуммаЗнВал(Объект.ПривязаноИзвне, Объект.Валюта) + "     ") + "Еще можно привязать: " + гоСуммаЗнВал(Объект.ОбщаяСумма - Объект.УжеПривязано, Объект.Валюта);
	// © Primus1C  16.03.2024  НАЧАЛО ►
	Объект.СтрокаИтого = СтрШаблон( НСтр("ru = '%1Еще можно привязать: %2'; en = '%1You can also bind: %2'"), 
							?(Объект.ПривязаноИзвне = 0, "", СтрШаблон(НСтр("ru = 'Привязано извне: %1     '; en = 'Binded from outside: %1     '"), гоСуммаЗнВал(Объект.ПривязаноИзвне, Объект.Валюта))),
				  			гоСуммаЗнВал(Объект.ОбщаяСумма - Объект.УжеПривязано, Объект.Валюта) );
							
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект, Истина, Ложь);
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	// © Primus1C  ОКОНЧАНИЕ ◄								

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.стрПривязкаСправа.Видимость = НЕ РазрешитьПервуюКолонкуПривязкиДолгов;
	Если РазрешитьПервуюКолонкуПривязкиДолгов Тогда  
		//хочу поставить на колонку суммы долга
		
		
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПривязкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПривязкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция фДатаОплаты(локДок)
    Попытка
		Возврат локДок.СрокОплаты;
	Исключение
	    Возврат гоПустаяДата();
	КонецПопытки; 
КонецФункции

&НаСервереБезКонтекста
Функция фСклад(локДок)
    Попытка
		Возврат локДок.Склад;
	Исключение
	    Возврат гоПустой("Склады");
	КонецПопытки; 
КонецФункции

&НаСервереБезКонтекста
Функция фСчет(локДок)
    Попытка
		Возврат локДок.ДокСчет;
	Исключение
	    Возврат 0;
	КонецПопытки; 
КонецФункции

&НаСервереБезКонтекста
Функция фПримечание(локДок)
    Попытка
		Возврат локДок.Примечание;
	Исключение
	    Возврат "";
	КонецПопытки; 
КонецФункции

// © Primus1C  14.03.2024  НАЧАЛО ►         

&НаСервере
Функция НоваяПривязка(Стр)
	
	Нов = Объект.Привязки.Добавить();
	
	Нов.СуммаДокумента 	= 0;
	Нов.ВалютаДокумента = Объект.Валюта;
	Нов.СуммаДолга 		= 0;
	Нов.ВалютаДолга 	= Стр.Валюта;
	//Нов.ОстатокДолга 	= Стр.ДолгПоставщику;
	Нов.ВалютаОстатка 	= Нов.ВалютаДолга;
	Нов.Док 			= Стр.Док;
	Нов.Примечание 		= "";
	Нов.ОбратныйКурс 	= Ложь;
	//Нов.КроссКурс 		= омСервер.КроссКурс(Нов.ВалютаДокумента, Нов.ВалютаДолга, Фирма, 5, Тек.Дата, Нов.ОбратныйКурс);
	//Нов.ПересчетДолга 	= ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
	//Нов.ЕщеДолг 			= Нов.ОстатокДолга - Нов.СуммаДолга;
	//Нов.ЭтоПредоплата 	= Ложь;
	Нов.ЕстьСумма 		= ?(Нов.СуммаДокумента = 0, 0, 1);
	Нов.ДатаОплаты 		= фДатаОплаты(Нов.Док);
	Нов.ДокДата 		= Нов.Док.Дата;
	Нов.Склад 			= фСклад(Нов.Док);
	Нов.ДокПримечание 	= фПримечание(Нов.Док);
	Нов.СчетДолга 		= фСчет(Нов.Док);
	//Нов.НельзяПривязывать = НельзяПривязывать ИЛИ (Нов.СчетДолга <> Объект.СчетДокументаОплаты);
	Если ТипЗнч(Нов.Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Нов.ИнвойсПоставщика = Нов.Док.ВКД_ИнвойсПоставщика;
	КонецЕсли;
	
	Возврат Нов;
	
КонецФункции    

&НаСервере
Функция НоваяПривязка2(Стр, Нов = Неопределено)
	
	Если Нов = Неопределено Тогда
		Нов = Объект.Привязки.Добавить();
	КонецЕсли;
	
	Нов.СуммаДокумента 	= Стр.Сумма1;
	Нов.ВалютаДокумента = Стр.Валюта1;
	Нов.СуммаДолга 		= Стр.Сумма2;
	Нов.ВалютаДолга 	= Стр.Валюта2;
	//Нов.ОстатокДолга = 0 + Стр.Сумма2;
	Нов.ВалютаОстатка 	= Стр.Валюта2;
	//Нов.Док = Стр.Док2;
	Нов.Примечание 		= Стр.Примечание;
	Нов.ОбратныйКурс 	= Стр.ОбратныйКурс;
	Нов.КроссКурс 		= Стр.КроссКурс;
	//Нов.ПересчетДолга = ?(Нов.ОбратныйКурс, Окр(Нов.ОстатокДолга * Нов.КроссКурс, 2), Окр(Нов.ОстатокДолга / Нов.КроссКурс, 2));
	//Нов.ЕщеДолг = Нов.ОстатокДолга - Нов.СуммаДолга;
	Нов.ЭтоПредоплата 	= Стр.ЭтоПредоплата;
	Нов.ЕстьСумма 		= ?(Нов.СуммаДокумента = 0, 0, 1);
	
	Возврат Нов;

КонецФункции

// © Primus1C  ОКОНЧАНИЕ ◄

&НаКлиенте
Процедура ПривязкиПередНачаломИзменения(Элемент, Отказ)
	Если ПравильныйВыход Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	//иногда возникает ошибка
	Попытка
		Имя = Элемент.ТекущийЭлемент.Имя;
	Исключение
	    Сообщить("ПривязкиПередНачаломИзменения: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	Стр = Элемент.ТекущиеДанные;
	
	Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");
	МожноСуммаДокумента = Объект.ОбщаяСумма - (Объект.УжеПривязано - Стр.СуммаДокумента);
	
	Если Имя = "ПривязкиСуммаДокумента" Тогда
		
		Если НЕ РазрешитьПервуюКолонкуПривязкиДолгов Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		Если Стр.СуммаДокумента = 0 Тогда
			
			Если Стр.НельзяПривязывать Тогда Отказ = Истина; Возврат; КонецЕсли; 
			
			//сказали проверять и пустой счет тоже, чтобы оба были пустые
			Если Стр.СчетДолга <> Объект.СчетДокументаОплаты Тогда клОшибка(НСтр("ru = 'Не соответствуют счета!'; en = 'The acounts don't match!'")); Отказ = Истина; Возврат; КонецЕсли; 
			
			//проверяем число привязок
			Если НЕ ПривязкиБезОграничений Тогда 
				Если Объект.Привязки.Итог("ЕстьСумма") >= 30 Тогда клОшибка(НСтр("ru = 'Достигнуто ограничение по числу привязок!'; en = 'The limit on the number of bindings has been reached!'")); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;
			
			ЛокСум = МожноСуммаДокумента;
			ЛокДол = Стр.ПересчетДолга;
			
			Если Объект.ОбщаяСумма < 0 Тогда
				//проверяем сумму, чтобы не превысила долг, только для обычного режима
				Если НЕ ХитроеУвеличениеДолга ИЛИ ЛокДол < 0 Тогда  
					Если ЛокСум < ЛокДол Тогда ЛокСум = ЛокДол КонецЕсли; 
				КонецЕсли; 
			Иначе
				Если ЛокСум > ЛокДол Тогда ЛокСум = ЛокДол КонецЕсли; 
			КонецЕсли;
			
			Стр.СуммаДокумента = ЛокСум;
		КонецЕсли; 
	ИначеЕсли Имя = "ПривязкиСуммаДолга" Тогда
		Если Стр.КроссКурс = 0 Тогда Стр.КроссКурс = 1 КонецЕсли;
		
		МожноСуммаДолга = ?(Стр.ОбратныйКурс, Окр(МожноСуммаДокумента / Стр.КроссКурс, 2), Окр(МожноСуммаДокумента * Стр.КроссКурс, 2));
		
		// © Primus1C  28.10.2024  НАЧАЛО ►
		Если БазоваяВалюта(Стр.ВалютаДокумента) = Стр.ВалютаОстатка Тогда
			//МожноСуммаДолга = МожноСуммаДокумента;
		КонецЕсли;
		// © Primus1C  ОКОНЧАНИЕ ◄
		
		Если Стр.СуммаДолга = 0 Тогда
			
			Если Стр.НельзяПривязывать Тогда Отказ = Истина; Возврат; КонецЕсли; 
			
			//сказали проверять и пустой счет тоже, чтобы оба были пустые
			Если Стр.СчетДолга <> Объект.СчетДокументаОплаты Тогда клОшибка(НСтр("ru = 'Не соответствуют счета!'; en = 'The acounts don't match!'")); Отказ = Истина; Возврат; КонецЕсли; 
			
			//проверяем число привязок
			Если НЕ ПривязкиБезОграничений Тогда 
				Если Объект.Привязки.Итог("ЕстьСумма") >= 30 Тогда клОшибка(НСтр("ru = 'Достигнуто ограничение по числу привязок!'; en = 'The limit on the number of bindings has been reached!'")); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;
			
			ЛокСум = МожноСуммаДолга;
			ЛокДол = Стр.ОстатокДолга;
			
			Если Объект.ОбщаяСумма < 0 Тогда
				//проверяем сумму, чтобы не превысила долг, только для обычного режима
				Если НЕ ХитроеУвеличениеДолга ИЛИ ЛокДол < 0 Тогда  
					Если ЛокСум < ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
				КонецЕсли; 
			Иначе
				Если ЛокСум > ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
			КонецЕсли;
			
			Стр.СуммаДолга = ЛокСум;
		КонецЕсли;
	ИначеЕсли Имя = "ПривязкиКроссКурс" Тогда
		
		//если уже есть суммы, курс не редактируем
		Если (Стр.СуммаДокумента <> 0) ИЛИ (Стр.СуммаДолга <> 0) Тогда Отказ = Истина; Возврат; КонецЕсли;
		
		//если валюты одинаковые, зачем менять курс?
		Если Стр.ВалютаДокумента = Стр.ВалютаДолга Тогда клОшибка("Странное желание!"); Отказ = Истина; Возврат; КонецЕсли; 
		
		//2013.12.14
		//получается, что это лишнее, и так всем запретили менять КК
		//Если ТолькоПривязки = 2 Тогда клОшибка("Без К/К!"); Отказ = Истина; Возврат; КонецЕсли; 
		
		//2013.12.02
		//здесь хотят менять в текущем дне для всей бухгалтерии
		
		//2014.04.21
		//не только Мельник, будут еще люди, именно в текущем дне
		
		//Если НачалоДня(Объект.ДокументОплаты.Дата) = гоТекущаяДата() Тогда 
		//	Если НЕ (гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("ОплатыКурсТекущийДень")) Тогда клНетПрав(); Отказ = Истина; Возврат; КонецЕсли; 
		//Иначе 
		//	Если НЕ (гоМельник() ИЛИ гоКолинко()) Тогда клНетПрав(); Отказ = Истина; Возврат; КонецЕсли; 
		//КонецЕсли; 
		
	ИначеЕсли Имя = "ПривязкиПримечание" Тогда
		
		//зачем примечание, если нет сумм привязки
		Если (Стр.СуммаДокумента = 0) И (Стр.СуммаДолга = 0) Тогда Отказ = Истина; Возврат; КонецЕсли;
		
	ИначеЕсли Имя = "ПривязкиДок" Тогда
		
		Пар = Стр.Док;
		ОткрытьЗначение(Пар);
		Отказ = Истина;
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПривязкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	//иногда возникает ошибка
	Попытка
		Имя = Элемент.ТекущийЭлемент.Имя;
	Исключение
	    Сообщить("ПривязкиПередОкончаниемРедактирования: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	Стр = Элемент.ТекущиеДанные;
	
	Если Имя = "ПривязкиСуммаДокумента" Тогда
		ЛокСум = Стр.СуммаДокумента;
		ЛокДол = Стр.ПересчетДолга;
		
		//для минусоов - свой алгоритм
		Если Объект.ОбщаяСумма < 0 Тогда
			//проверяем сумму, чтобы не превысила долг, только для обычного режима
			Если НЕ ХитроеУвеличениеДолга ИЛИ ЛокДол < 0 Тогда
				Если ЛокСум < ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
			КонецЕсли; 
		Иначе
			Если ЛокСум > ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
		КонецЕсли;
		
		Если гоАбс(ЛокСум) > гоАбс(МожноСуммаДокумента) Тогда ЛокСум = МожноСуммаДокумента КонецЕсли; 
		
		Если Стр.КроссКурс = 0 Тогда Стр.КроссКурс = 1 КонецЕсли;
		
		Стр.СуммаДокумента = ЛокСум;
		
		Стр.СуммаДолга = ?(Стр.ОбратныйКурс, Окр(ЛокСум / Стр.КроссКурс, 2), Окр(ЛокСум * Стр.КроссКурс, 2));
		
		Стр.ЕщеДолг = Стр.ОстатокДолга - Стр.СуммаДолга;
		
		Если Стр.СуммаДокумента = 0 Тогда Стр.Примечание = "" КонецЕсли; 
		
		//новое для подсчета
		Стр.ЕстьСумма = ?(Стр.СуммаДокумента = 0, 0, 1);
	ИначеЕсли Имя = "ПривязкиСуммаДолга" Тогда
		ЛокСум = Стр.СуммаДолга;
		ЛокДол = Стр.ОстатокДолга;
		
		//для минусоов - свой алгоритм
		Если Объект.ОбщаяСумма < 0 Тогда
			//проверяем сумму, чтобы не превысила долг, только для обычного режима
			Если НЕ ХитроеУвеличениеДолга ИЛИ ЛокДол < 0 Тогда
				Если ЛокСум < ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
			КонецЕсли; 
		Иначе
			Если ЛокСум > ЛокДол Тогда ЛокСум = ЛокДол 	КонецЕсли; 
		КонецЕсли;
		
		Стр.СуммаДолга = ЛокСум;
		Стр.СуммаДокумента = ?(Стр.ОбратныйКурс, Окр(ЛокСум * Стр.КроссКурс, 2), Окр(ЛокСум / Стр.КроссКурс, 2));
		
		Если гоАбс(Стр.СуммаДокумента) > гоАбс(МожноСуммаДокумента) Тогда 
			
			Стр.СуммаДокумента = МожноСуммаДокумента;
			Стр.СуммаДолга = ?(Стр.ОбратныйКурс, Окр(Стр.СуммаДокумента / Стр.КроссКурс, 2), Окр(Стр.СуммаДокумента * Стр.КроссКурс, 2));

		КонецЕсли;
		
		Стр.ЕщеДолг = Стр.ОстатокДолга - Стр.СуммаДолга;
		
		Если Стр.СуммаДокумента = 0 Тогда Стр.Примечание = "" КонецЕсли; 
		
		//новое для подсчета
		Стр.ЕстьСумма = ?(Стр.СуммаДокумента = 0, 0, 1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПривязкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//иногда возникает ошибка
	Попытка
		Имя = Элемент.ТекущийЭлемент.Имя;
	Исключение
	    Сообщить("ПривязкиПриОкончанииРедактирования: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	Стр = Элемент.ТекущиеДанные;
	
	Если Имя = "ПривязкиКроссКурс" Тогда
		КК = Стр.КроссКурс;
		КО = Стр.ОбратныйКурс;
		ВД = Стр.ВалютаДолга;
		
		Для Каждого Стр Из Объект.Привязки Цикл
			Если Стр.ВалютаДолга <> ВД Тогда Продолжить КонецЕсли; 
			Если (Стр.СуммаДокумента <> 0) ИЛИ (Стр.СуммаДолга <> 0) Тогда Продолжить КонецЕсли;
			Если Стр.КроссКурс = КК Тогда Продолжить КонецЕсли; 
			
			Стр.КроссКурс = КК;
			Стр.ПересчетДолга = ?(Стр.ОбратныйКурс, Окр(Стр.СуммаДолга / Стр.КроссКурс, 2), Окр(Стр.СуммаДолга * Стр.КроссКурс, 2));
		КонецЦикла; 
	КонецЕсли; 
	
	Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");
	Объект.СтрокаИтого = ?(Объект.ПривязаноИзвне = 0, "", 
							СтрШаблон(НСтр("ru = 'Привязано извне: %1     Еще можно привязать: %2'; en = 'Binded from outside: %1     You can also bind: %2'"),
                                гоСуммаЗнВал(Объект.ПривязаноИзвне, Объект.Валюта),
								гоСуммаЗнВал(Объект.ОбщаяСумма - Объект.УжеПривязано, Объект.Валюта) ));
	// © Primus1C  17.03.2024  НАЧАЛО ►
	Объект.СтрокаИтого = СтрШаблон( НСтр("ru = '%1Еще можно привязать: %2'; en = '%1You can also bind: %2'"), 
							?(Объект.ПривязаноИзвне = 0, "", СтрШаблон(НСтр("ru = 'Привязано извне: %1     '; en = 'Binded from outside: %1     '"), гоСуммаЗнВал(Объект.ПривязаноИзвне, Объект.Валюта))),
				  			гоСуммаЗнВал(Объект.ОбщаяСумма - Объект.УжеПривязано, Объект.Валюта) );
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект, Истина, Ложь);
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	// © Primus1C  ОКОНЧАНИЕ ◄
	Модиф = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Если Объект.Привязки.Итог("СуммаДокумента") = 0 Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), НСтр("ru = 'Очистить суммы во всех строках?'; en = 'Clear amounts in all rows?'"), , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Для Каждого Стр Из Объект.Привязки Цикл
		Стр.СуммаДокумента = 0;
		Стр.СуммаДолга = 0;
		Стр.ЕщеДолг = Стр.ОстатокДолга;
	КонецЦикла; 
	
	Объект.УжеПривязано = Объект.Привязки.Итог("СуммаДокумента");
	Объект.СтрокаИтого = ?(Объект.ПривязаноИзвне = 0, "", 
							СтрШаблон(НСтр("ru = 'Привязано извне: %1     Еще можно привязать: %2'; en = 'Binded from outside: %1     You can also bind: %2'"),
	                              гоСуммаЗнВал(Объект.ПривязаноИзвне, Объект.Валюта),
								  гоСуммаЗнВал(Объект.ОбщаяСумма - Объект.УжеПривязано, Объект.Валюта) ));
	
	Модиф = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ПравильныйВыход Тогда Возврат КонецЕсли; 
	Если НЕ Модиф Тогда Возврат КонецЕсли; 
	
	//клОшибка("Используйте кнопку " + гоИмя("Сохранить и выйти") + "!");
	клОшибка(СтрШаблон(НСтр("ru = 'Используйте кнопку %1!'; en = 'Use button %1!'"), гоИмя("Сохранить и выйти")));
	
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Функция ПривязкиВСтроку()
	Табл = Объект.Привязки.Выгрузить();
	Возврат ЗначениеВСтрокуВнутр(Табл);
КонецФункции

&НаКлиенте
Процедура СохранитьИВыйти(Команда)
	ПравильныйВыход = Истина;
	
	клДаНет(Новый ОписаниеОповещения("СохранитьИВыйтиЗавершение", ЭтотОбъект), НСтр("ru = 'Сохранить изменения?'; en = 'Save changes?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИВыйтиЗавершение(Результат, ДопПараметры) Экспорт
	Пар = Неопределено;
	
	Если Результат Тогда 
		
		//проверяем число привязок
		Если НЕ ПривязкиБезОграничений Тогда 
		    Если Объект.Привязки.Итог("ЕстьСумма") > 30 Тогда клОшибка(НСтр("ru = 'Достигнуто ограничение по числу привязок!'; en = 'The limit on the number of bindings has been reached!'")); Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;

		//если уже на все согласились, удалим строки, где нет суммы документа
		
		Нашли = Объект.Привязки.НайтиСтроки(Новый Структура("СуммаДокумента", 0));
		Для Каждого Стр Из Нашли Цикл
			Объект.Привязки.Удалить(Стр);
		КонецЦикла; 
		
		Пар = Новый Структура;
		Пар.Вставить("ПривязкиСтрока", ПривязкиВСтроку());
	КонецЕсли;
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры

&НаКлиенте
Процедура ПривязкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//иногда возникает ошибка
	Попытка
		Имя = Элемент.ТекущийЭлемент.Имя;
	Исключение
	    Сообщить("ПривязкиВыбор: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки; 
	
	Стр = Элемент.ТекущиеДанные;
	
	Если Имя = "ПривязкиДок" Тогда
		СтандартнаяОбработка = Ложь;
		Пар = Стр.Док;
		ОткрытьЗначение(Пар);
	КонецЕсли; 
КонецПроцедуры

// © Primus1C  28.10.2024  НАЧАЛО ►

&НаСервереБезКонтекста
Функция БазоваяВалюта(Вал)
	
	Возврат Вал.БазоваяВалюта;	
	
КонецФункции // ()

// © Primus1C  ОКОНЧАНИЕ ◄
